/**
 * Author: ryabykh_ms (upstrocker)
 * Email: upstrocker@gmail.com
 * GitHub: https://github.com/upstrocker
 *
 * Секретный замок для сейфа состоит из 10 расположенных в ряд ячеек, в которые надо вставить игральные кубики.
 * Но дверь открывается только в том случае, когда в любых трех соседних ячейках сумма точек на передних гранях
 * кубиков равна 10. (Игральный кубик имеет на каждой грани от 1 до 6 точек.)
 * Напишите программу, которая разгадывает код замка при условии, что два кубика уже вставлены в ячейки.
 */

package ru.tn.courses.mryabykh.task1.v3.subtask2;