/**
 * Author: ryabykh_ms (upstrocker)
 * Email: upstrocker@gmail.com
 * GitHub: https://github.com/upstrocker
 *
 * Сортировка обменами. Дана последовательность чисел а1, а2, ..., аn.
 * Требуется переставить числа в порядке возрастания. Для этого сравниваются два соседних числа аi и ai+1.
 * Если аi > аi+1, то делается перестановка. Так продолжается до тех пор, пока все элементы не станут расположены
 * в порядке возрастания. Составить алгоритм сортировки, подсчитывая при этом количество перестановок.
 */

package ru.tn.courses.mryabykh.task1.v3.subtask3;